["Take a sample of soil from spiritual lands located deep within a forest on a remote planet.",
"Search for a mysterious hacker that is using the weather controls to change the weather.",
"Gather video footage of a politician's nightly excursions for his election opponent.",
"Eliminate a spiritual leader who claims to live forever.",
"Deliver a computer message from one place to another and not tell it's secret when it accidentally goes off.",
"Capture a man who has been inducing suicide all ove the city.",
"Capture a professional arsonist before he escaped to a different system.",
"Find a way to eliminate a man in charge of the State secret police and seems to act upon actions before they happen.",
"Stop an assassin who is to eliminate a famous conductor during the interlude between music.",
"Protect long range mission probes from attack by those who wish to steal it.",
"Deliver an exploding package to a corporate official.",
"Shut down the Secret Corner bar which is supposedly an establishment for drug dealers.",
"You must locate the creator of an antibiotic and find a way to reverse its effects.",
"Rescue a young girl from the clutches of a psychotic murderous gang.",
"Travel to an orbital station inhabited by something and destroy it.",
"Get revenge upon a small company who sold the wrong group armor and weapons that were flawed.",
"Rescue a group of commandos from a station where they are believed to be held captive.",
"Journey to a moon that is blasted in radioactive waves from a huge gas giant in search of a radioactive orb.",
"Frighten the hell out of a local boss and explain that he should not mess with the mega-corp.",
"Capture a sample of a critter that only comes out in the light of a full moon - once every year.",
"Destroy a corporate warehouse at exactly ten past eight P.M.",
"Stop the onslaught of a religious group who believe they cannot be killed.",
"Stop a group of squatters from food rioting without killing a single one.",
"Stop a bomb from detonating inside a crowded shoppin mall.",
"Protect a small town from the creatures which seemed to have landed in a meteorite from space.",
"Wait and ambush a group of illegal traders as they come by.",
"Transport a man with a terrible transformation disease to a major hospital.",
"Investigate activity at the headquarters of an enemy state unknowing they are about to attack en masse.",
"Travel to the location where a mysterious spacecraft has crashed.",
"Rescue a group of prisoners from a maximum security prison.",
"Destroy a small nuclear generator at a remote outpost which has started to produce a mysterious blue radioactive haze.",
"A powerful, but primitive, group of locals is about to attack.",
"Stop them.",
"Someone is watching the residents of a planet and whoever is doing it is unknown to the locals. Find out who and why.",
"A powerful noble has gone absolutely nuts and must be transported to an institution. Quietly.",
"When a group of locals lose their land to developers they do not give up easily.",
"A group of rebellious extremists is about to mount an attack. Eliminate some of the group's leaders so it is not possible.",
"Capture an AWOL special forces soldier who has fled into the countryside without letting the locals know.",
"Extract a bride and groom during their wedding ceremony.",
"Keep a messenger from traveling from here to there.",
"Stop a local gang which has been menacing the street using high tech weaponry.",
"Protect a crew reconstructing a destroyed mega-cor plant from attacking radicals.",
"Recover a prototype high tech chip recently stolen by some local kids who want it for their new game.",
"Find out why rain clouds keep coming from the same valley in the mountains.",
"Protect the underground silo of an experimental probe from incursions.",
"Screw up the plans of a group of missionaries to build a bridge for a village.",
"Transport stuff through an area known as hijacker' haven.",
"Intelligence reports a surge of weapons into a bad neighbor. Get proof.",
"Go into a compound after another group has left and try to stop them before they enter a trap.",
"Help put out an exotic fire that is beyond the local tech level.",
"Get a band of locals to leave town without killing them.",
"Rescue a man from a time loop from within a corporate facility.",
"Show a wanna-be the ropes and make sure he gets killed by an enemy.",
"Deliver a captured man into a chamber within corporate grounds.",
"Kidnap a star and deliver her to a deranged man.",
"Stop a group of predators who use a neighborhood as their killing grounds.",
"Kill a cop who uses mind games on other cops to get his way.",
"Stop a war any way possible before it erupts into full scale war.",
"Deliver a man into the desert and help him find his lost soul.",
"Journey to the place of the damned and bring backsacred shrines.",
"After a ship crashes you must steal a shipment of drugs from within the wreckage.",
"Protect a town when it is invaded by a warring tribe.",
"Journey to an ancient lost city and bring back proof of its existence.",
"Find and retrieve a young soldier who is AWOL, hiding in the woods.",
"When a ship sinks, rescue the political survivors before th people who bombed them have a chance to return.",
"Assassinate a well known star during the grand finale of her performance.",
"Convince a factory owner that he should hire a special worker.",
"A news hero is found to be a fake. Capture the media ma who set up the fake.",
"Deliver a eulogy to the site of a very important funeral.",
"Journey to the bottom of a pit to retrieve a scientist's droppe instrument.",
"Enforce a fee that must be paid by all before traveling through a secret passage.",
"Penetrate a makeshift fortress set up by a group of psychos and administer a drug to them.",
"Destroy/stop the atmosphere terra-forming plant which is causing a giant sand storm.",
"Deliver a drug into the depths of a riot area to stop the riot.",
"Find out why everyone suddenly disappeared fromtown.",
"Deliver a man into a snowy region and leave him for dead.",
"When a prank develops fears of an apocalypse, you must protect a street/government/person from looters.",
"Restart an old electric generator which has been taken over.",
"Travel a hundred miles across an ice ridge to rescue a noble/official/member.",
"Hired by the military to go and stop a band of AWO mercenaries marauding the local countryside.",
"Hired to kill a band of people who they say are AWOL and who they say are marauding the local countryside. The truth is that one man is a scientist who does not want the designs for a powerful weapon/drug/device to get out.",
"Hired to infiltrate a restaurant called Thieves World and to locate the kingpin and bring him to their employer.",
"Hired to assassinate/kidnap an old lady in a nursing home.",
"Hired to patrol a length of trail high in the mountain where poachers have been shooting a rare bird.",
"Track down a person who keeps attempting to destroy the dam which keeps a river from destroying the town.",
"Kill the oldest man for the second oldest man.",
"Find a killer which knocks on doors and kills people.",
"Rid an old remote mansion of an infestation of vermin.",
"Shut down a lab which does hideous experiments on animals.",
"Find proof of a company which dumps toxic waste forliving.",
"Steal the prototype for a laser from a large company.",
"Bring in human sacrifices for a satanic cult.",
"Destroy drones wired with explosives before release.",
"Capture the old man who has been living in a castle for over years - alone.",
"Hired to find the only person who has not been seen for five years but is capable of defeating the ultimate champion.",
"A college fraternity wishes to get back at another for a prank.",
"Steal the research of a man who may have found immortality.",
"Travel to a remote station to stop people who have taken it over and used it to turn up the heat on local traffic.",
"Find and rescue the survivor of an old crashed space probe before any other group gets to him.",
"Destroy a fully automatic rail gun armed asteroid headed for the planet.",
"Close down a facility which brainwashes its customers.",
"Convince a nightclub owner that it would be a good idea to hire a rich guy's daughter.",
"Go to the front lines of a real war with a reporter.",
"Peacefully convince two groups that it is not a good idea to kill each other.",
"Purposely lead a group of men into an ambush.",
"Capture a runaway science experiment.",
"Get rid of the nobles who have taken over a small town and made themselves gods.",
"Search the jungle for an underground lost city and bring back information on its location and content.",
"Bring down a renegade in a tank.",
"Track down someone who starts fires using plastics andremote control.",
"Lead a strike on a corporate chemical weapons facility.",
"Fight with one gang to eliminate the other - or cause them to fight one another.",
"Raid a religious town and capture the sacred item which they worship.",
"Save the hostages taken prisoner at a casino by an Ex-Military mad man.",
"Quietly snipe off a leading politician.",
"Protect a religious group as they trek looking for a mystical new world.",
"Stop a rich guy's son who is on his way someplace determined to rid the city of something.",
"Steal a lot of money from a rich guy's vault.",
"Transport a load of financial certificates from one place to another.",
"Track someone named Rat and capture him for a company he stole millions for.",
"Race a test model for a company.",
"Obtain the plans to mechanoid robots and fight some too.",
"Shut down the system causing flood weather to man farms.",
"Steal a load of ancient stuff from a museum.",
"Bodyguard a star for several nights.",
"Help a religious person become the leader and assassinate him so he'll look like a martyr.",
"Fire & Stop an arsonist from burning down his girlfriend's house.",
"Get a pendent out of a vault of treasures - don't let anyone know.",
"Assassinate one group so that the other can rule.",
"Capture the cop who is using his position to rob and kill people.",
"Beat the hell out of a biker because he won't pay his bar tab.",
"Assassinate the leader of a small city state/planet/kingdom.",
"Assist a criminal's escape from prison.",
"Make weapons, deal with an illegal company and transport the shipment.",
"Help fight a fire raging through the forest.",
"Get a refund from a supplier who is selling shoddy goods.",
"Get a picture of the leader of one of the largest cults.",
"Protect a rich man's beer wagon from marauders.",
"Teach a group of wanna-bees to be real fighters. Make them rich and annoying.",
"Deliver the design for a high tech assault weapon to him.",
"Steal the design to one of the strangest toys ever made.",
"Go on a planet/system/sector wid assassination assignment.",
"Find the raiders of a small countryside village.",
"Follow a group of cops and get evidence of their wrong doings.",
"Find out why there is a voice emanating from a brick wall in a basement.",
"Rescue the star player before he is killed by his captors.",
"Receive a challenge from a defeated enemy.",
"Find the queen of a colony of bugs and kill it.",
"Join a group and bring back a membership certificate.",
"Fight a predator colony.",
"Journey to a remote region and bring back information on their culture.",
"Sabotage the client's opponent's racing team.",
"Stop an important business man, who has gone psycho without harming him.",
"Deliver drugs to a cafe and then screw them out of their money.",
"Search the city for individuals who are willing to become the host bodies for an insect cult.",
"Stop a group of pranksters whose tricks are beginning to turn lethal.",
"Track down the person who has embedded an organic/mechanical item into your client.",
"Deliver an alien back to his home, which has been taken over by human bigots.",
"Travel into a warehouse under siege and provide support for as long as it takes.",
"Blow up an entire city block for a terrorist group.",
"Stop a train which is rapidly heading towards a downed bridge.",
"Kidnap anybody and deliver that person to a ma whose ego is so bad it demands he have a slave.",
"Safely deliver a peaceful leader across the countryside without using vehicles, electronics, or violence.",
"Track down a group of children who have been on missions for more than two years.",
"Take the last percentage of a crystal needed by a company from an armed group.",
"Transport a man who is prone to horrible bad luck, overa long distance.",
"Fix a one on one brawl so your client wins, without the opponent knowing you helped.",
"Get rid of an ice creature which has inhabited a store owner's freezer.",
"Take the remaining money from a vault in an abandoned place.",
"Assassinate the king of a remote tribe for your client.",
"Snap a guy back into reality by using whatever means necessary.",
"Attempt to assassinate a man who always manages to avoid the shot.",
"Find the past of a young amnesiac and report it to the police.",
"Eliminate an old man who continues to run a large crime ring.",
"Stop a woman before she hangs herself for an e boyfriend.",
"Administer a drug to a high level politician.",
"Eliminate a pirate who constantly harasses shipping.",
"Stop a shipment of poisoned balloons from reaching their destination.",
"Fire off a group of well guarded cannons on a naval base.",
"Rescue a woman who is about to be executed.",
"Travel to a place where a crevasse has opened up revealing an apparently bottomless pit.",
"Crash a drug party and eliminate/capture/stop the people who put it on.",
"Inject a man and his girlfriend with a drug, and freeze their bodies.",
"Calm a refugee camp before they decide to riot in the city.",
"Deliver a load of laughing gas into the city council's central chambers.",
"Capture a killer who is responsible for the deaths of many people.",
"Protect a group of religious people as they make a dangerous pilgrimage for their god.",
"Knock out a free radio station which is operating illegally.",
"Capture and freeze a famous singer so it can be a statue insicko's house.",
"Protect a professional singer from a messed up fan.",
"Add firepower to an attack of a company to steal a line on new vehicles.",
"Stop a killer who knocks out the electricity in vita areas and kills people.",
"Find out what is causing the extreme strangeness ofhigh level officials.",
"Assassinate three men who are a symbol to their religious cult - at the same time - and make it look like an accident.",
"Transport a sealed case of formulas out of the area for later pick up.",
"Protect the scene of a crime from the murderer who is very likely to return.",
"Find the story behind a guy who has been following and playing mind games with a woman.",
"Find a hidden treasure within the depths of a secret garden located by a mansion.",
"Take out a politician completely silently without anyone noticing.",
"The world has just built a beautiful monument. Blow it up.",
"Make a young woman fall in love with you then break her heart.",
"Travel into the place of fear and find out what the worst nightmare is.",
"Protect yourself from a vengeful victim.",
"Get a series of dirty pictures of a politician' daughter.",
"Blow away a king of a small world in broad daylight near a crowd.",
"Take over a mansion and make your employer's screwed u child a princess for a day.",
"Protect a dam from the mercenaries who are out to destroy it.",
"Steal the design for a new drive from a corporate building.",
"Dramatically blow up the driveway circle at the noble's mansion.",
"Screw up a fine time at the carnival by creating a series of accidents.",
"Steal a rare bird from a business man's private collection.",
"Kidnap a woman who is good with plants for a man.",
"Find a strange cocoon from the depths of a recently formed cave.",
"Assassinate a man who claims he is the one and only god.",
"Track the movements of someone as he enters, travels through, and exits the starport.",
"Stop an onslaught on a small house that never occurs.",
"Become friends with a man and convince him to come to a cliff with you and then push him off.",
"Kill everyone located within a known drug den which turns out not to be that.",
"Someone wants a control surface panel with a certain logo on it off of a military vehicle.",
"Eliminate all information from corporate records.",
"Transport an ancient man frozen in ice to a research facility.",
"Frighten a team into having better morale by ambushin them.",
"Transport a mysterious vehicle from one corporate facility to another without it transporting you.",
"One of you is infected with a disease that causes schizophrenia.",
"Take dirt from five dangerous locations all over the planet.",
"Transport a chip to an island surrounded by giant carnivoresusing only low tech.",
"Eliminate an all female mercenary group which continually steals from a corporation.",
"Taken prisoner by a madman who will not let them go.",
"The adventurers have seven nights to get a man named Jack to a hospital and encounter lots of trouble.",
"A scientist has discovered a breakthrough, and other scientists want him dead because of it.",
"The adventurers must kidnap someone from an underwater facility.",
"Ruin a Mardi Gras party by blowing the hell out of everything and kidnapping a politician and his wife.",
"Destroy an isolated camp on a remote frozen moon inhabited by your employer's enemy.",
"Protect a singer against an obsessed fan who specializes in creative harassment.",
"Prove a love potion doesn't work to a love struck budd - and fall in love.",
"Steal a special plant from the middle of an enormou green house without damaging anything else.",
"Under the direction of a local law enforcer, raid a mob' headquarters' building.",
"Take a high tech device from the man who invented it.",
"Silently administer a happy drug into a meeting without them noticing.",
"Keep an annoying and dangerous man away from a corporate woman without hurting him.",
"Rescue a man's body which has been in an accident and bring it back to a hospital.",
"The client just wishes to be anywhere but where she is - anytime.",
"Eliminate a man's bird pests before they destroy yet another crop.",
"Take out the pompous leader of a group.",
"Take a millionaire hostage and demand a load of money for ransom.",
"Steal a new song by a star and destroy all other copies.",
"Find a way to get the creature that has entered a man's body out.",
"Steal out a band's instruments while they are in their mountain cottage.",
"Take a man who is horribly afraid of the woods deep into the forest for a cure.",
"Deliver a bomb found within the city to a far off plac before i detonates.",
"Keep workers from completing a low class housing project.",
"Snipe off the client's competitors if they are about to beat him just before they cross the finish line.",
"Travel to an old mission and rescue the girl who is held hostage there.",
"Take out an enemy camp before they have the chance to organize themselves.",
"Steal the lottery ticket of the winner as soon as he finds out that he won.",
"Steal the manuscript of a new book from its writer.",
"Out of pure ego a crime family wants the entire enemy family eliminated.",
"Kill the twin, but of course you can't tell them apart.",
"Steal a top secret package as it is transported from base to base.",
"Steal a series of five objects from a man's son' friends because the kid is spoiled.",
"Carry out the absurd request of a madman to eliminate all crime organizations.",
"When a creature escapes from the zoo the adventurers must put him back.",
"Travel to a place to bump off a bunch of people only to find a horrible creature has beaten you to it.",
"Inject a special drug into the people a corporation is holding in a coma.",
"Produce some fake footage for a government craft which crashed into a residential neighborhood.",
"Tape a series of incriminating conversations betweenpoliticians and a foreign power.",
"Steal a shipment of military grade weapons.",
"Find out whether or not a bar is a drug distributor.",
"Destroy an offshore rig which is slowly poisoning the waters.",
"Eliminate/capture a sea serpent which has established its home in a resort lake.",
"Donate a limb for a large amount of money which will be replaced later.",
"Prove the sexual relationship between a corporate officia and someone.",
"Fast & Do a lightning quick strike upon a center and blow it up in less than thirty seconds.",
"Ready,Rescue a man who is about to be executed before a military firing squad.",
"Take out the champion who is extremely concerned about security.",
"Protect a low tech medieval caravan from attackers while undercover.",
"Slowly eliminate everyone from an apartment complex so only the client remains and make it look like accidents.",
"Stop a worm infestation from an artist's sculpture without harming the work.",
"Convince a man who wants to and does kill that there is a better way and if it doesn't work kill him.",
"Rescue a woman from the dungeon beneath a deranged man's castle.",
"Knock out the lights at a bar and randomly kill several people.",
"Help a group of religious travelers along a dangerou journey to where they say utopia is.",
"Gas bomb a no weaponry bar with gas that cause people to go nuts for several hours.",
"Protect a child through the most terrifying journey of his existence.",
"Sleep with someone, get it on video, and place the tape on their spouse's doorstep.",
"Get a man's true confessions on video tape before he blows his brains out.",
"Keep someone kidnapped for an entire summer.",
"Experience the life of a schizophrenic and get paid.",
"When the adventurers go to rescue a girl she is in a place that keeps getting worse and worse.",
"Disarm a group of bomb rigged and trapped dum waiters.",
"When a woman loses her husband to a mistress she wants both of them maimed.",
"Transport a famous star to see her sister who apparently wishes to kidnap her.",
"Legally gain enough evidence to convict a noble debutante of being a murderer.",
"Capture a religious group who has taken up shop on the power grid.",
"Capture proof of a politician's lie about cleaning upwaste dumps on tape.",
"Take the president of a toy company and throw him into a vat of funny gas.",
"Take the flag from an Imperial Navy ship for a rich child.",
"Protect a singer as she travels on a long tour into the most remote regions.",
"Take out a paramilitary group who specializes in snow combat.",
"In an underground series of caverns, find a way to escape.",
"Protect a high level business man for several days as he travels to and from work.",
"A poor woman asks the adventurers to rid the neighborhood of a gang.",
"Destroy the remaining stock of an action figure so the existing ones will go up in value.",
"Disturb the peace and get arrested so you can kill a man in jail.",
"Photograph a man and his wife while they are in their high security apartment.",
"Stop the member of a wedding who plans on killing the groom.",
"Find and stop whatever is causing contamination.",
"Force an eighteen year old noble to come back and stay with his parents.",
"Wipe a planet's records of a specific century.",
"Steal an expensive portrait from an art museum.",
"Silence the critters that roam the sewers and make a horrible sound.",
"Bomb a refinery in an attempt to completely wipe out th entire compound.",
"Travel to a far off place to deliver the Crying Crystal to its rightful place.",
"Watch over a loner who has returned home and is suspected of arson and capture him if he does anything.",
"Guard a woman who is terrified from a series of cran calls.",
"Help a woman, who killed her husband's mistress, escape from the city.",
"Plant a bomb in the middle of a utopian society.",
"Take a challenge to break into a guarde facility without any weapons.",
"Protect the Society of Love from constant attacks by a hate group.",
"Try to end a long and bloody war between two groups any way possible.",
"When a working man is harassed on his way to work he decides not to take it any more.",
"Stop a psychotic man who has bunkered up inside of a corporate facility.",
"Join a competition on an abandoned bridge where groups battle it out.",
"Before & Destroy the food storage area for a refugee camp and travel back later to guard it while it is fixed.",
"Rescue a downed pilot who has gone nuts and wh thinks no other people are real.",
"Deliver a shipment of trick exploding holsters as a gift to an enemy.",
"Kidnap a city intellectual and extract information about his new book from him.",
"Find out the secret behind the cry which constantly emanates from the bottom of a ravine.",
"Assist a man in his gruesome suicide by helping hi sethimself afire atop a political monument.",
"Hired to find a missing ship and crew who missedpayment for an insurance underwriter only to find the captain dead in a remote place - and still no ship.",
"Wake up in a strange place, with no one around, and have no idea who you are."]