["Vistaru, Lord of the Mountain, is attacking small towns surrounded by his kingdom in hopes of expanding his army before his assault on the capital.",
"Locals hear chants in the nearby ruins.",
"Someone in the party is secretly a half-wolf",
"Undead threaten cities across the nation.",
"The queen has been assassinated.",
"A large gang/terrorist organization wages war against a local city.",
"The party comes across a gladiator stadium and is offered money in return for fighting.",
"Dragon blood is needed to cure a plague and your group is sent to collect some.",
"A powerful bard hires your party to retrieve a fabled magical instrument from a dead wizard's coffin.",
"Breaking into a dungeon/room/fortress etc. to rescue or capture a person or artifact.",
"Safari; characters must hunt down a creature.",
"Mysteriously, an entire city has lost its inhabitants overnight.",
"The characters must chase escaping bandits through the countryside/are chased by bandits through the countryside.",
"Discovering a portal to another plane leads to an exploration party.",
"A medusa is constructing a garden of statues using townsfolk.",
"Statues in a large cemetery come to life at night.",
"A lich is raising a massive undead army.",
"The party finds a small cursed object (marble, figurine, ball bearing) which keeps multiplying every day. They have to find a way to destroy it before its carrier gets crushed under the weight.",
"A giant believes that all humans exist for his dining pleasure.",
"A man with one eye is being hanged for 'looking sinister.'",
"Catacombs have opened beneath the city, guarded by ancient undead who let no one pass.",
"The sacred spear of Lesh has gone missing.",
"There is a black cloaked man in a tavern, though he is dead. Everybody says they saw him walk in just fine.",
"An ogre regards a female party member as 'The perfect mate.'",
"A god's weapon has fallen to earth and now there is a race to obtain it.",
"Suddenly an entire country turns black.",
"A party member discovers a great sword made of red metal that has the properties of adamantine, mithril, silver and cold iron, but can be wielded in one hand as if it were a long sword. What is it? (the godly weapon, perhaps?)",
"A party member's armor comes to life and tries to leave.",
"A tribe of trolls is trying to make peace with a nearby village.",
"A mountain village is plagued by inexplicable earthquakes. It's actually the wrath of a Greater Earth Elemental, who had an eye ripped out by a clueless miner who thought it was a normal gem.",
"The party meets several groups of travelers headed in the same direction, claiming to be going to something called 'The Games.'",
"An earthquake that leaves magical glowing fissures in the ground shakes directly beneath a kingdom's capital.",
"A previously righteous and good god suddenly calls genocide on all that are not his followers.",
"A paladin is after a party member because of a case of mistaken identity.",
"A member of a party of adventurers is on the run from the law but the Duke has asked to see the party. The adventurer is welcome but the guards do not know this and the character must be smuggled into the city.",
"A druid is accused of killing other druids.",
"A very superstitious village is holding a witch trial, and a party member is mistaken for a famous paladin and called to act as the judge.",
"A hidden pathway in an abandoned house leads to a lair of a terrible Demon. The Demon keeps 'slave girls' where a friend of the party is, but the 'slave girls' are secretly Demons in disguise.",
"One of the party members is offered a slave girl as a reward for a job well done. Another character - e.g. a Paladin - finds this outrageous and demands he let her go.",
"The party and some others are raiding a city when they are captured and forced to entertain the king in the gladiator's arena.",
"A large tribe of Orcs are planning a raid on an Imperial city.",
"A Mage summons a demon but is unable to control it and is possessed.",
"The world is hit by an asteroid that mutates anyone that touches it.",
"A large egg of some sort is discovered and the Orcs are coming for it. Will the characters try to hatch it?",
"A thick plague-inducing fog is slowly covering the countryside.",
"A Paladin goes mad, turning evil while still thinking he is good.",
"The characters are shrunk by an evil wizard and have to find a way to reverse the spell.",
"An illusion of peace and tranquility is projected over a town. The characters must escape and discover what is really happening.",
"The God of Time punishes a town/city/village for not worshiping him, making everything happen out of sequence.",
"All the local wildlife is killing people; are the Druids to blame?",
"Everyone is turned into monsters and the characters are run out of town.",
"The characters are framed for a genocide they didn't cause.",
"While crossing a sea, the boat is sunk by a monster of some variety. The characters are saved by mer-folk but trapped on a deserted island miles from the mainland.",
"A dragon captures the party and takes them to her mountain lair to feed to her wyrmlings.",
"The characters complete a job but their employer doesn't want to pay them.",
"Monsters are attacking a castle; the party must prevent the monsters from taking the castle.",
"A large rock worm is attacking a large city. One of the characters must kill the rock worm before the city goes under.",
"A time warp descends upon an isolated village, setting everyone and everything back a century into the past.",
"Several of the king's tax collectors have disappeared after traveling to a particularly dangerous area.",
"A good cleric tries to establish a temple to his god in a hostile city, hoping to gradually convert the populace.",
"Suspicion arises that the inhabitants of a town are gradually being replaced by impostors.",
"Animals within a particular area are becoming monstrous and mutated.",
"Ships are disappearing within a five-mile radius of the ocean.",
"A phantom river barge sails past a small town once per month, leaving malevolent, supernatural occurrences in its wake.",
"A local ruler is suspected of making a pact with a powerful devil or demon.",
"The Assassin's Guild is planning to kill the mayor.",
"A witch's curse is causing a farmer's crops and livestock to die.",
"A mysterious curse is settling on town after town, rendering almost all forms of magic ineffective - e.g. ice and wind magic - while greatly empowering any who make use of Black or Demonic magic.",
"A band of clerics is robbing the graves at a large cemetery, creating an army of undead creatures.",
"A secret vigilante society is inflicting barbaric punishments on 'evil-doers.'",
"The daughter of a nobleman has run off with a seedy, disreputable commoner.",
"A small community of neutrally-aligned Orcs tries to convince inhabitants of a nearby town that they mean them no harm.",
"A formerly good cleric is suspected of secretly worshiping an evil god.",
"About to be hanged for his crimes, a powerful bandit leader is sprung from his prison by his cohorts.",
"Kobolds occupy an abandoned mine, using it as a base from which to launch raids on Human settlements.",
"A Sorceress has lost her unique familiar and all efforts so far to reveal the creature's whereabouts have been fruitless.",
"The party is sent to deliver the ransom for a woman, who is being held by a gang of brigands.",
"The king's ambassador has disappeared while en route to a hostile country and is suspected of being a traitor.",
"A megalomaniacal Duke has sent his minions in search of a weapon that would make him nearly invincible.",
"The king, a just, good ruler, is somehow being manipulated by his new adviser.",
"A series of murders are being committed with the MO of an executed killer.",
"Clerics are stymied as to how to remove a bizarre desecration that has fallen upon their temple.",
"Strange, glowing runes appear on the door of the town hall, forming a riddle.",
"A local farmer is suspected of breeding hellhounds, after several of the beasts were spotted killing the cattle of other farmers.",
"A Kraken is destroying any ships that try to enter or leave a city's port.",
"During a break from traveling in a big city, the party wakes up to find all of the city's inhabitants missing and the gate locked...",
"A growing maelstrom near a rocky coast is sucking ships down beneath the waves.",
"The party members are hired as marshals to escort a powerful Fallen Paladin back to the city, where he is to stand trial.",
"Magical droughts are descending upon an increasing number of communities.",
"The king sends the party to parlay with an adjacent kingdom contemplating war.",
"Villagers are fed up with a group of troublesome mercenaries.",
"Dryads fight to preserve their forest against an encroaching Human settlement.",
"A cleric asks for your help to rehabilitate a recently caught gang of thieves.",
"Messengers must travel through a haunted swamp to deliver a timely warning to the Queen.",
"Members of a coven have infiltrated the city's populace and are working their black magic.",
"A magical fire in town resists all efforts to extinguish it.",
"An ancient artifact must be retrieved from the bottom of the sea.",
"A druid is framing a werewolf by committing crimes while in the form of a wolf.",
"Local bandits are far too well informed about trade caravans. A trade post keeper is suspected of being an informant.",
"A small town is being raided every few weeks by an unusually well organized group of Goblins and Hobgoblins. It turns out that a group of Goblin Shaman ordered these raids in order to draw out the best soldiers and mercenaries in the region before unleashing a massive army of Goblins, Hobgoblins, Bugbears, Ogres and Trolls.",
"A merchant comes to the characters to ask them to retrieve a chest that was stolen by furbolgs. When the group finds the furbolgs, they are told the merchant had been hiring mercenaries to hunt and kill them so he could trade their pelts.",
"A cursed orb serves to reduce intelligent lifeforms into feral states and enrage any animals that come upon it.",
"A young fey must prank the group to be accepted by or meet the dare of a peer group and the characters may not realize it is a classic scenario of peer pressure.",
"A magic ring is found that offers complete immunity to an element, but any party member within a certain range experiences temporary random alterations in their own items.",
"A water elemental demands the party drop a coin in the creek or river in order to be allowed to cross a bridge.",
"A prideful orc is challenged by his friends to arm wrestle the strongest member of the group. From the looks of things they aren't giving you a choice, and they are forcing a wager.",
"The party was once the elite task force for the King only to find out from a Duke they were sent to kill that the King is working for dark forces, gathering the shards of a crystal which his dark master is trapped in. They must now run as outlaws and try to stop this evil being from rising again.",
"A wyvern has made the city gatehouse its home. A siege is on the horizon and the gatehouse must be operational as soon as possible!",
"A skilled warrior joins forces with the party, but a recurring memory disorder leads her to wake up one day believing she has been captured.",
"Distinct armor recently looted by the party turns out to have once belonged to the father of a local hero, who identifies it and confronts the party.",
"A powerful arachnomancer attempts to conquer the area with his spider minions; the party is sent to kill him.",
"A cabal of powerful golem-builders has sent a messenger to a Kingdom with a threat; submit to their demands or they will unleash their colossi upon the Kingdom.",
"Entering a flooded cave in a boat, the party members find themselves in the company of a paladin and a warlock. The situation soon begins to get out of hand.",
"Each locked in a small cell with a single tiny window, fed the barest amounts of bread and water and deprived of their equipment, the party is held captive.",
"A cursed, animated rope tied itself around the wrists of two men who hate each other, forcing them to stay close.",
"The party must travel the globe searching for the pieces of an ancient set of armor.",
"Soon after looking into an enchanted mirror, the characters meet shadowy copies of themselves.",
"The person the group was sent to meet has been replaced by a doppelganger.",
"A powerful Demon offers each of the party members their greatest wish. This is too good to be true.",
"An Sorcerer seeks to uncover a massive ancient construct with world breaking power. The party is sent by the King to stop him. At the end the group must choose whether they should destroy the construction or hand it over to the King.",
"The chosen Queen of (race or sub-type) has arrived! (May have protection and mind-control spells, etc.) She has more followers than one might expect for such a newly declared monarch. All her kin gather to serve her and reclaim their rightful place in the world.",
"A Witch had turned the village children into scarecrows.",
"While exploring an old rundown castle, the group accidentally releases an ancient evil and, in the process, each member is possessed by a Demon. While trying to find a way to stop the creature they released from destroying all they know, they must each wage their own personal and internal war with the Demon who possessed them to prevent the loss of their soul.",
"A new Outer Plane has been discovered, that of the bleak, dead wastes of Scriothia.",
"The group is thrown into a game where they must find weapons and armor. They start with just the average clothing and no supplies. But they aren't the only ones in the game. Happy hunting!",
"The party is sent to a fort to help defend it from (monster of choice).",
"A terrible ogre has been treated with sedatives by the village shaman. But the drugs ran out and now the ogre is suffering from withdrawal. The party must provide him with counseling and find ways to treat his anxiety and dizziness before he smashes everyone in the village.",
"The heroes seek fortune, fame, or power (depending on the characters or individuals). They discover a job that pays steadily and promises a big reward at the end, hired adventurers aboard a captain's ship (their boss) and is sent out to discover new lands with mysteries waiting against a rival explorer organization.",
"The party arrives to new land in binds, ready to be delivered as slaves.",
"The party is kidnapped by a great wyrm and tossed in the deepest layer of its dungeon.",
"The party finds themselves facing an impossible foe (Minor God/Elder Dragon/etc) who serves an even greater power and is attempting to usher in the end of all they know by bringing his/her master forth. The party must find clues to the locations of ancient tools used to stop the last attempt hundreds of years before, before those same tools are used by their enemy who is also searching.",
"One of the party has amnesia and is in reality a powerful being who is a natural enemy of the group. Will the party remain friends when the memories return? The party member's true identity starts to reveal itself as the member starts displaying abilities they should not have. (Works best when you choose a player's character and you don't tell the player)",
"The party is a group of monsters! Gaming from a different point of view!",
"A wild mage in the area talks in his sleep... random craziness happens whenever he goes to bed.",
"The party is constantly being hassled by a person/company/pixie that is insistent on collecting a very small debt and will not take anything but exact payment.",
"A little girl is in reality a horribly powerful vampire. She wants to play...",
"The party is sent to deliver a package to a private residence, it turns out to be a humiliating task (think pizza delivery). Will the party put up with the insult?",
"A haunted giant tree's inhabitant, a Sage, has his powers tinkered with and accidentally teleports the party to the top of it. Can the party make it out?",
"Your party is sent for a peace talk between dwarven clans, but things get messy.",
"The city is being held under siege by monsters; possibly Voadkyn. Voadkyn wishes for 'The Sacred'; if 'The Sacred' is returned, the city will be left in peace. If not, the city will be ripped apart piece by piece and all within it killed until 'The Sacred' is located. The monsters will not react to questions like, 'What is ‘The Sacred'?' except by looking stupidly at our adventurers and repeating again: 'It is ‘The Sacred''. The party must discover what 'The Sacred' is and return it to the Monsters to save the city from certain doom.",
"Searching for a person (who doesn't want to be found) on behalf of a well-to-do citizen.",
"An ancient map is found showing locations of 5 ancient cities.",
"A Sphere of Annihilation has appeared. The party must seek out and use the Talisman of the Sphere to prevent the end of all.",
"The party must choose sides or negotiate in a conflict/revolt between overtaxed or oppressed people and their tyrannical rulers.",
"A member of the party receives an inheritance which includes developed land (keep, castle, tower, etc). Upon further investigation, the party finds it inhabited...",
"Every night, fey creatures from a nearby grove kidnap a person in their sleep and force them to take part in a drinking contest.",
"Rumors of disappearing ships create food shortages in a local fishing town. The party investigates...",
"A strange creature is hiding within one of the players and the others must choose to help or to Kill...",
"The Dead have risen and, while not attacking the nearby townspeople, they refuse to let anyone pass in order to protect their still-living loved ones from something that now inhabits the graveyard...",
"A curse has been set to kill all animals in the country...",
"An innkeeper leads you to a quest where you must kill a necromancer but it turns out the innkeeper was the necromancer.",
"A dwarven embassy lets in peasants to increase the city population but they won't let anyone leave.",
"The party meets a crazed horse breeder who kills travelers and feeds them to his horses.",
"A small village has a conflict between two chefs on what is the better way to prepare a famous dish in the town. It has the village split into two different sides.",
"A potent curse placed on a pious priestess has a succubus manifest through her body at inopportune times. Each is conscious of what the other does when she's controlling the body, and while they've gone over the initial shock, their differences always lead them to argue and struggle for control.",
"There is a cult in a city that has 100 chickens and the soul of a great hero is trapped in one of the chickens and they don't know which one it is so they worship all of them.",
"There is an underground group of criminals that is branched into separate groups with the leader of each branch having a significant ring and once all gathered together it was unlocked their hidden magical properties.",
"A wise old mage has gone blind and requires you to create a potion reversing the spell on him by creating a potion with him describing what each ingredient looks like.",
"There are five shards of a legendary dagger hidden across the land and they are well hidden. If the party gathers them all they get a legendary prize.",
"A dead man rises from his grave and, oblivious to his own death, goes back to living with his family.",
"A large group of wild animals attacks a population with strategy. They are being led by a druid in animal form.",
"The town's local hero has gone missing hunting kobolds in the mine.",
"Neighboring kingdoms on opposite sides of a mountain are about to go to war. The only way to stop it is to escort the emissary to the other kingdom - through the mountain passage.",
"The party notices a spider sitting under a peculiar web near a temple of Lolth: its lines read 'I have been cursed for desecrating the temple. Find my Druid son, he can turn me back to normal'",
"Three Mul from Athas stumble through a portal, and are deposited into a city on the Sword Coast. They are baffled by the differences between the two worlds.",
"A knight asks you to capture a relatively weak monster and sic it on his kind hearted but cowardly squire, hoping he will toughen up from the fight.",
"You are trapped in a small cell for days on end. You are not told why.",
"A riot has erupted on an island, government aid is nowhere to be seen, and gangs are feuding to claim turf and riches. Will the party be the virtuous heroes trying to save innocents and re-establish order, lend their strength to one of the factions, or just do their own thing?",
"Various people have been found drained of all their blood recently. A culprit is caught, but while they confess to being a vampire they claim to be innocent.",
"A succubus is 'haunting' the dreams of willing victims in exchange for money and favors.",
"Two feuding demons have decided to settle their differences by picking two groups of mortals and directing them like chess pieces.",
"Animals and monsters in an area have gained sentience and the ability to speak. They're mostly friendly, but hunting is an important part of the region's economy and the local lord will have none of it.",
"A fountain that spouts water which heals all sickness has erupted from the ground. Those who drink from it become dependent and violent and soon start killing anyone who approaches the font.",
"A mysterious assassin is on the loose. The only clue is their arrows, which have a distinctive design and always strike the victims through the heart killing them instantly.",
"A civilization which has been cut off for centuries offers to pay you handsomely if you bring them pieces of modern culture and technology.",
"The party is chasing after a certain monster around the continent",
"After a string of recent freak earthquakes, a ravine opens up near a small, remote village, with what appears to be a large fortress made entirely of dark stone at the bottom.",
"One of the party members is secretly a vampire and is attempting to hide it from the local authorities.",
"News spreads that a dragon was slain while away from his cave, a search for its unguarded hoard is underway",
"A thief has stolen a powerful item from a lich and then joins the party for protection",
"A wizard/collector wants a live troll to study",
"Rat catchers are going missing under the city and a plague is spreading in their absence",
"A local caster has summoned a creature that they cannot contain and it is destroying the area",
"A charismatic charlatan claims (and has proof) to be the cousin/brother/son of one of the players",
"A wandering merchant trades a player for their magic item for a fake he claims is more powerful",
"Shipments from a nearby mine have stopped, when the players investigate they find the miners crazed and covered with red welts apparently from exposure to a new element they uncovered",
"A white dragon is driving monsters from the north into the southern lands",
"A planar rift has formed and outsiders are seeping through",
"A powerful noble/wizard is hosting a masquerade ball where the guests are polymorphed into monster as their costume, but an actual monster attends to kill the noble/wizard",
"A sorcerer has died of old age, strange things are creeping out of his tower as his spells, and dweomers break down",
"A map has been found that leads to parts of an artifact that once reassembled, will summon a fiendish kraken",
"The dead are rising as zombies one hour after their death",
"Slavers are capturing peasants and merchants on the highway and selling them to mind flayers",
"A shop/traveling merchant sells pets/familiars that are actually polymorphed people",
"The players are sent to find a hermit that lives on the 'moving island', a zircon/dragon turtle",
"A traveling circus/faire comes to town and completely vanishes in the morning with several children",
"An Ur priest cult is killing all the divine casters in the area",
"Water drawn from a certain well is animating into water elementals/mephits",
"An evil druid has taken up residence in the sewers and is waging a guerilla war on civilization",
"Anyone who reads a cursed book, brought into town by an adventuring party, dies after reading it",
"A killer is leaving rare flowers in the mouths of his victims",
"A member of a planar cartographical society offers the players membership into the elite group if they can complete a scavenger hunt that leads them across several planes in one day",
"A mysterious helmed/hooded/masked figure has forged an impressive army by bringing tribes of kobolds, goblins, orcs, and hobgoblins under one banner. The leader is actually a cleric disheartened by the lack of faith and respect of his flock and means to increase belief and prayer for his deity by leading an army of wolves against his flock",
"The owner of a failing inn claims to have the entrance to a mysterious dungeon in his cellar hoping that the ruse will draw business from adventurers",
"A pack of displacer beasts/displacer beast lord are preying on farm animals and farmers alike",
"Two rival gangs are actually devils and demons fighting a Blood War battle on the city streets",
"The daughter/apprentice of a caster that polymorphed himself into a golden cup and placed himself in the hoard of a green dragon in an attempt to learn more about dragons, but it has been weeks and he has not come home contacts the players",
"Reports that a gold dragon is ravaging the countryside turn out to be true. The dragon, sick with a rare disease, has gone mad and must be stopped",
"Grave robbers working for a necromancer are running out of graves and start looking for easy prey",
"A 'red' dragon demanding tributes from a village is actually an especially greedy copper dragon",
"A killer is released from prison and the father of one of his victims stages a similar murder in the hopes of framing him",
"A traveling 'holy man' is selling relics that disappear in the morning",
"The new judge is in fact a devil hoping to harvest souls for not guilty verdicts",
"A logging camped is being haunted by the ghost of a treant/forest haunt and his dryad followers",
"A band of fey have been stealing wine from a rural tavern",
"A good and helpful aranea has been captured and tried for murder while the true culprit is a drider that resides close by",
"A college that teaches science over magic opens and arcane casters start going missing",
"Drug related deaths lead the players to an evil alchemist",
"The players are hired to retrieve a meteor, but find it is being worshiped by a tribe of goblins/orcs/lizardmen etc.",
"Several woman in the area are pregnant under strange circumstances, an incubus is to blame",
"An artifact is needed to avert a major catastrophe; its last known owner was Levistus the arch devil trapped within a glacier",
"The players must find a rare herb only known to grow within Goth monasteries",
"The players visit a strange village where all the people are simulacrums, an ancient wizards mark is seen everywhere",
"The players are sent to a distant land to find an Nplayer that it turns out has been dead for 20 years",
"The players must help a conflicted Erinyes to the Cradle of Creation (phb2) to be reborn into a non-evil body",
"A map leading to the legendary Shield of Praetor has been found, it states that the shield is in the cave of a dracolich. The map was sent by the dracolich's minions in the hopes of freeing their master who is sealed magically into his cave",
"A local orphanage is actually run by a demonic cultist that sacrifices the weak children and raises the strong ones to be followers",
"A powerful artifact that will allow teleportation through the layers of the abyss/hells has been uncovered and a race to claim it has begun. The players must beat the groups of devils and demons that see the artifact as a powerful tool to end the Blood War",
"An overmatched Marut seeks assistance with a powerful lich/vampire/mummy",
"Rumors of 'The most powerful sword' lead the players to an evil, intelligent, dancing sword that can animate other weapons to fight for it",
"The players are sent to a battlefield to retrieve a family heirloom from a missing soldier where a necromancer and his corpse collector golem are raising the fallen as undead",
"A cult of Tiamat have discovered a spell that ages living creatures and they are trying to use it on dragon eggs to raise powerful allies",
"The players are sent to deal with a raiding ogre that turns out to be a gnome illusionist",
"The players are looking for an arrow used to slay a dragon a hundred years earlier, but when they pull the arrow from the dragon's skeleton, it animates and attacks",
"The players need the help/information of a treant that will only add them if they agree to be shrunk down to clear out an infestation of insects that invaded his roots",
"The players are invited to a Three Dragon Ante tourney, either as guards, VIPs, or to play",
"A lawful good lich (Monsters of Faerun) seeks the players to protect him from a zealous paladin on a quest to rid the world of undead",
"Thieves have plundered a tomb and until his golden burial mask is returned, a ghost/ghast/specter will continue to kill innocent people",
"A group of fire giants has taken up residence in an inactive volcano, their activity threatens to awaken the volcano and cause widespread devastation",
"A grandmotherly, if slightly senile, Nplayer asks the players to rid her attic of rats. The rats are in fact a group of thieves trying to open a magical doorway left by the wizard that previously owned the home",
"A monster seen roaming close to town is actually a cursed person and not evil",
"The players find a genie in a bottle, but the genie agrees to help/grant wishes/serve only after the players travel to the City of Brass and save someone the genie cares about",
"The players find a wounded angel that is being hunted by powerful outsiders",
"A newly discovered dungeon is actually a complex trap to harvest souls/magic/life energy",
"The players must break an innocent man from a complex magical prison",
"Murders attributed to a small girl are being done by her doll, a slaymate (libris motris)",
"An ancient beholder has gone mad and his destroying the Underdark, driving monsters to the surface",
"A gnome settlement has been overrun by Drow displacing hundreds of citizens",
"A mad wizard has been selling potions that have poisonous/odd effects",
"Mind flayers are draining people of their quintessence in hopes of using the substance to return to the far realm from which aberrations came",
"A spelljammer has crashed in a remote forest/jungle and the inhabitants seek materials to repair their helm",
"A foreign diplomat seeks the party's monk to protect him on a mission to a country/city where magic and weapons are not allowed",
"The tarrasque is wreaking havoc on the countryside and the party (lvl 10ish) must slow it down until the champions (20th) can arrive, but the tarrasque is actually a simulacrum (cr 10) sent by an outsider/caster/etc. and not the real thing",
"Cultist seek a tablet that depicts a ritual that will summon a Fist of Spite (BoVD)",
"The party must save an Nplayer from the stomach demiplane of Dalmosh (MM5)",
"The guild master of the cooper's guild wants to discredit the owner of a local winery with whom he has had an argument by poisoning his barrels",
"A local sage/astronomer is convinced that a massive meteor is going to strike the kingdom/city/town",
"The normally-inert gargoyles atop the temple/castle/mansion have animated and started attacking people who approach the building",
"A group of bulettes is keeping anyone from entering or leaving the city/town/inn",
"A doppelganger/changeling serial killer claims the identity of their most recent victim for one week before killing again",
"A gnome settlement has been overrun by fiendish duergar led by a demon",
"players seek out a powerful dwarven smith that traded his soul to Asmodeus for unearthly crafting abilities. Before the smith will help the players, they must reclaim his soul from the arch devil",
"The players find/are sent to a city that reflects the entire multiverse scaled down with a neutral inn in the center run by a power caster",
"The players search for a legendary library that when found, has no books only the corpses of long-dead sages and librarian clerics that use speak with dead to obtain the knowledge",
"The players need a party member/Nplayer raised from the dead but the only cleric powerful enough to do so has recently been turned by a vampire he was hunting",
"The players find/buy/are given a strange bag of holding that has a small pocket dimension inside it where a frightened caster hides. He/she created the bag to hide in and saw that it ended up in the players hands to keep it safe",
"The players seek an answer/information from a forgotten bard. When they find him, he is a ghost and he will only help them if they give him peace by finishing his final poem/song/movement",
"A chaotic good horselord (CAd) has led all the horses in the region/city/town away into the hills to freedom",
"The huntsman of a local lord/mayor has kidnapped the Nplayer's daughter, and only a highly trained tracker can follow the trail and find the girl",
"An aged and grizzled warrior is going town to town offering his magic sword/shield/armor to any fighter that can best him in honorable combat",
"After returning from a diplomatic journey, the noble/diplomat/prince/queen is acting strangely. The players are asked to look into it only to find that the Nplayer is a doppelganger/changeling/simulacrum/charmed/possessed",
"A pair of ethereal filchers are stealing all the curative magic in the area/city/town",
"The answer/riddle/name/code that the players require is etched onto the helm of a massive golem that paces a deadly dungeon",
"Monthly full moon attacks are blamed on a good lycan, and are actually being carried out by a pack of Moon Rats (MM2)",
"Summoned Thoqqua threaten to compromise the structural integrity of the city/town/inn/dungeon/ as they melt tunnels through the ground below",
"Centaur knights (phb2) are running any humanoid from their forest",
"The players are sought by the patrons of a desert land where a despotic temple of cleric charges impossibly high rates for fresh water to people not of their faith",
"A temple has hired a large number of bards for a festival where music is to be played from sun up until sundown, the only problem is that no one recalls the obscure holiday because it is a ruse to mask the sound of tomb robbers breaking into sealed vaults below the church",
"A xenophobic elvish lord has begun to arrest non-elves after his daughter eloped with a human",
"A green dragon descends upon the players' castle, but instead of attacking, begs them to help save her wyrmlings from an evil princess.",
"While attending a tournament, the players witness a legendary sword be shattered in a duel. Onlookers scramble to take its magical shards for themselves.",
"The first gun is invented, but its creator mysteriously dies before any more can be made. Now everyone wants her only creation.",
"Pirates attacked Freeport, but took no plunder and left immediately. A player receives a letter delivered by parrot, saying that they'd better hurry to Freeport if they want to find the map the pirates hid there.",
"Three hundred dead octopuses wash up on the shore of a lake. Dead marine life increasingly appears wherever the players go, no matter how far they are from water. Then, the dead creatures rise as undead.",
"The trolls and elves of Ardyn Grove have been fighting for centuries, but now the trolls apparently want a truce. Their leader—a troll warlock of the Great Old One—specifically requests an elf player to lead the peace talks.",
"The players are a group of treasure hunters and discover a map to an ancient idol that grants a single wish. Only problem is, the map is written in Primordial runes.",
"A world-renowned bard sends a message to the players that she wants to play a gig at their fortress. The day of the show, she discovers all her instruments have been magically silenced.",
"All the dragons in the land are devolving into dinosaurs! Their treasure hoards are now up for grabs, but a stampeding herd of tyrannosaurs also threatens the outlying towns.",
"A famous actor named Marco the Million-Faced Man performs a one-man show in town. After the performance, Marco, actually a doppelganger, kidnaps and impersonates a player and tries to steal the party's magic items.",
"While the players are staying in a small-town inn, a man suddenly breaks out in red boils and dies. Medicine checks reveal that everyone has contracted the Crimson Plague, including the players. They have only 3 days to create or discover a cure.",
"The Cloud Whales of ancient myth have unexpectedly returned, pulling the Chariot of Infinite Riches across the sky. They are peaceful, but are unintentionally causing havoc as gold coins fall from their chariot and rain from the sky. There must be a way to reason with them, but they're all the way up in the air!",
"All of the water in the land is draining away into the Elemental Plane of Water. A charismatic noble starts a rumor that a wizard or druid player is the cause of the disaster, but does she have an ulterior motive?",
"Late one night, a star falls to a mountaintop just outside town. As the nights pass, more and more stars plummet to the earth, and people fear that the fire elementals emerging from the fallen stars are just the vanguard of a much deadlier force.",
"An infamous lich visits the players unannounced and says he's very sorry and wants to make up for his evil deeds, and promises them incredible magic if they help him.",
"A group of dragon turtles has blockaded a port that the players desperately need to use. They speak politely, but their voices are mysteriously muted whenever they try to discuss why they have formed the blockade.",
"The players find a set of armor of invulnerability, but once a player attunes to it, the armor takes on a life of its own and goes on a rampage—with the character still inside it!",
"An assassin is sent to kill the players, but he is killed by another assassin right in front of them. Before the counter-assassin can be questioned, she's killed by another assassin, who in turn is killed by…",
"The players return victorious from a quest to discover they have a fan club in town. They're plucky, but quickly become trouble when they appear without warning in the midst of the players' next dungeon crawl.",
"A player awakens without an appetite, and can't keep down food or drink. Over the next week, the character loses their sense of touch, then speech, then finally sight and hearing. They seem to be metamorphosing into something else.",
"A minotaur was victimized by a wizard, and now he will hire you to lead him through his own labyrinth to his treasures.",
"A painter has been using magic to easily duplicate his own paintings to sell as originals. But a fowl art critic with a penchant for theatrics is on to him and has sworn to reveal the secret unless he is permitted to marry the artist's only daughter. The artist hires you to eliminate the critic who knows too much.",
"The sun set 26 hours ago. The world is in panic. The Drow are invading, and only the heroes can stop them.",
"A madman who thinks he is a prophet is slaughtering the livestock of the local farmers in the hopes that it will bring forth Ibanirox, the Night Eater, a long forgotten (and made up) deity of immense power. The farmers offer the group 20 gold or 3 cows per adventurer.",
"A theater director hires the party to keep his lead actor (who is marked for death by a crime syndicate) alive long enough to perform in front of a powerful monarch. The assassins attempt to make his death scene a real one.",
"A tribe of kobolds has taken up residence in the sewers and has been hunting dogs and cats as food.",
"The player's are sent after a powerful artifact/weapon that will make their patron unstoppable.",
"The player's are hired by a Gensai sorceress to recover her mephit familiar from an enemy.",
"A mysterious stranger tips the player's off to an assassination plot, even giving them detailed plans stolen from the assassin. After the attempt the player's are implicated and the detailed plans found on their person or in their room.",
"Mind flayers are performing perverse rituals on local orc tribes and granting them psionic abilities. The party must find and destroy them before psionic orcs destroy the kingdom.",
"Ancient prophecies predict that a star will fall at a precise location on a certain day. Whoever is first to grasp the star will receive a wish. Various dark factions camp and await the coming of the star, intent on making their wish.",
"A devil/caster/demon/warlock has set a fire using hell fire and it can only be quenched by the waters from a spring in Celestia",
"A Devil prince coerces you to sabotage the wedding of one of his political rivals.",
"A besieged city holds a tournament to mock their enemies. The King asks you to sneak into the city and win the tournament to demoralize them.",
"A wizard believes he has discovered the location of the wreckage of a legendary battleship, but so has his rival. You must recover the arcane weaponry from the wreck before the opposing team does.",
"You are hired to perform a filibuster in the legislative body of a monstrous nation. It proves dangerous.",
"An ancient and complex prison facility for extraplanar criminals is malfunctioning. The party must repair it as a group of imps attempts to use the facility against them.",
"The party is sent to investigate the disappearance of a missionary cleric in a vast and dark jungle. Investigation reveals that the cleric has instead been converted by the demon-worshiping jungle people and now mobilizes them against his former mission.",
"Gnolls have dug up the severed head of a lich in the desert, and it has promised them great power if they reunite him with his body.",
"A band of Drow (or similarly evil humanoids) comes to town claiming to be not evil and seeking asylum.",
"Ghostly dryads haunt the grove where their tree was destroyed and they can only be put to rest if the grove is replanted.",
"A werewolf, seemingly immune to wolfs bane and silver terrorizes a village. He is in fact the barghest.",
"A ruined tower is in fact a colossal animated object.",
"A yeth hound poses as a wounded blink dog.",
"The player's seek an item buried within a grove sacred to a centaur tribe.",
"A delver tunneling under the city is causing earthquakes.",
"The characters are sent to a primitive island to retrieve an item/find a treasure/seek an nplayer. The island is filled with dinosaurs, near-humanoids, and dire animals. As the player's explore the island they begin to devolve, as do their animal companions, mounts, familiars, etc.",
"The mayor, sheriff, high priest, has been replaced by doppelgangers.",
"A white dragon is freezing ships and carrying them off to his glacial home.",
"A major port is now home to spawning dragon turtles.",
"Dryads have taken loggers hostage.",
"All news and shipments from a dwarven stronghold have stopped; the king frees a Duergar attack.",
"Ettercaps have poisoned village children and carried them off, the player's know they have a limited window in which to rescue the children before they are eaten (as ettercaps like to let their dinner hang and liquefy before eating).",
"Hippogriffs, run off their mountain roosts by a red dragon, have begun devouring cattle.",
"All the townspeople in a village have contracted lycanthropy and become were-moose at the full moon. The group must discover that the alchemist upstream of the village's water supply has been experimenting with dangerous chemicals to turn his beloved pet albino moose, Alabaster, into a sentient best friend.",
"The player's break a law in an unjust and evil land while doing something good, but are later pursued by a zelekhut for their actions.",
"The elementals that power a dwarven forge have broken free and must be captured without harming them.",
"A thief tells the party about a dragon graveyard that contains the treasure of a dozen hoards, but is haunted by ghostly-dragon guardians.",
"The player's require the help of a lillend, but she refuses unless the party's bard can impress her with his musical abilities.",
"Ice mephits have frozen the town's well.",
"Merfolk are waylaying ships from traveling over a sacred coral reef.",
"A gelatinous cube, used to eat waste, has escaped the sewer and must be lured back down.",
"Drunken satyrs have carried off a number of women from the village.",
"Will o' the Wisps are luring people to their swamp.",
"All the animals in the village have collected on a hill nearby and refused to come down.",
"A splinter cult of Drow are kidnapping townspeople and sacrificing them to a powerful aranea sorceress, they worship as an avatar of Loth.",
"The player's hired by a local politician that fears he will be poisoned at an uplayeroming banquet.",
"Thieves have stolen dragon eggs and put the entire town in jeopardy as the angry mother wreaks havoc.",
"The 'haunted forest' is actually filled with awakened creatures.",
"A mage's guild seeks thieves to steal an artifact that will hamper the use of magic. They plan to use it to control all magic in the city.",
"A stray cat taken in by the player's is the familiar of an enemy spell-caster.",
"Mongrel Men living under the city are demanding citizenship and full rights.",
"The local wizard's college wants to hire the player's to capture some new familiars.",
"A con artist posing as a priest is fleecing peasants.",
"The player's must stop an angry mob from attacking a peaceful tribe of orcs.",
"A glacier has been discovered with an enormous, nightmarish creature inside and the ice is beginning to melt.",
"The player's are asked to serve as guardians to a young noble whose parents have been killed.",
"The player's must smuggle a message into a besieged city.",
"A dying dragon holds a contest to give away pieces from its hoard.",
"Lizardman-half-Mindflayers are being spotted in the marshes outside town.",
"A vigilante is killing evil criminals in town. The party is hired to capture him, while the people view him as a hero and champion of good despite his methods.",
"Something has driven all the game from the king's hunting grounds.",
"Prisoners are being sold to mind flayers.",
"Marble carved from a newfound quarry is animating.",
"The prison has been taken over by the prisoners.",
"When the well goes dry, the villagers discover a glowing portal to Sigil.",
"A wizard/engineer wants help capturing elementals to power airships.",
"A wizard polymorphed into a chimera is attacking caravans.",
"The player's must acquire an artifact from the hoard of a fiendish-black dragon that resides in the swamps of Othrys on the plane of Carceri.",
"People are disappearing and paintings of the missing are showing up in the inn/temple/manor.",
"Fiendish weasels are terrorizing a farmers chicken coop. The family is on the edge of hunger and ruin.",
"A group of wild elves hire the player's to escort their clan to a new home in the Beastlands.",
"Something is causing the dead to rise from the local cemetery.",
"After a dark omen all cure spells function as inflict spells.",
"Wererats are stealing children and infecting them with lycanthropy.",
"After a Drow priestess is hanged, women in the city begin giving birth to spiders.",
"The player's encounter a strange man on the road who casts a spell on them/gives them a potion, shortly after they arrive in town to see (with their arcane sight) that half the town are actually changelings.",
"A farmer finds a possessed tablet in his field and begins going on a killing rampage.",
"The city's most powerful adventurers return from questing in a temple of Tharizdun.",
"A child has been bitten by a rare spider, and the only antidote requires some of the spider's venom.",
"A vampiric bard is dining on the finest artists in town.",
"A player learns that his family lost a powerful legacy item to a dragon. The item is still in the dragon's hoard.",
"The party is left to raise a brood of silver dragon wyrmlings after their mother is slain.",
"A child is possessed by a demon and must be exercised.",
"The player's are shipwrecked and must build a raft to escape.",
"A child in the slums is spouting doomsday prophecies and is gathering a large following.",
"The player's are drugged and forced into naval service by a violent press-gang.",
"The party's warriors are invited to participate in the alabaster cup (Com. Warrior).",
"The party is approached by an nplayer that claims to have detailed evidence of an assassination plot. The nplayer even shows them plans that he stole from the assassin. After the attempt is made, the player's are framed and detailed evidence is found in their room at the inn.",
"An awakened golem is creating an army of warforged to wipe the lands free of living beings.",
"A barbarian horde threatens to invade unless someone can defeat their leader in single combat.",
"The new mayor of a rural village is a Rakshasa.",
"A massive egg has appeared in the village square and cracks are forming.",
"Each night eerie organ music can be heard from the ruin manor on the hill; in the morning, a townsperson is missing.",
"Lightning continues to strike the same gravestone every night for the last week.",
"A wizard, pretending to be good, hires the player's to retrieve his 'stolen' spell book from a rival.",
"Cultists have obtained a scroll of Crushing Fist of Spite (BoVD) and intend on releasing it in the countryside.",
"A party member's soul has been purchased/stolen/bartered for, by Asmodeus and the party must debate the Devil lord to get it back.",
"A gnoll army sweeps from the north, their leader wields what appears to be the Triple Flail of Yeenoghu, Demon Prince of Gnolls.",
"A Cauldron of Zombie Spewing (BoVD) has been unearthed in an ancient ruin by clerics of Nerull.",
"A mad cleric has resurrected the stuffed monster in the party's favorite inn.",
"A strange, hitherto unknown city of dwarves suddenly invades a small human settlement in the foothills of the mountains with the express purpose of securing a safe water supply because all of the well water in their city has become like tar.",
"A wizard hires the party to kill another wizard that happens to be a temporal shifted duplicate of the wizard himself. Perhaps it's a time travel experiment gone awry, or perhaps the patron wizard is from the future and attempting to create a grandfather paradox.",
"An unconscious Psion is found in the woods outside a town, and monsters attack it, either in an attempt to get the Psion back for one reason or another, or the monsters themselves are created by the comatose Psion. Perhaps through his Psicrystal the party can enter his sleeping mind and sort this mess out (once the town is immediately safe)",
"A group of Fire mephits storm a cities 'Everburning Pyre' and attempt to summon a fire elemental",
"The party is tasked with tracking down an assassin who somehow can change his face. how I'd play it out: Initially it's thought to be a doppelganger or changeling, but in fact, the 'assassin' is merely the wielder of a powerful intelligent dagger that jumps from host to host like the ring of power trying to find its way into the hands of a worthy wielder.",
"One of the players gets a message that his wealthy father is dead, and he has to go collect an inheritance, but in actuality, IT'S A TRAP! And perhaps the father is not dead, and also not at all who the player assumed he was growing up.",
"A Paladin challenges a player to a duel over a former evil deed that is not properly atoned for.",
"Suddenly the cleric's spells stop working and it becomes a quest to find out why: Perhaps the god is dying, or the cleric has accidentally offended him... Probably not a great quest unless the Cleric is in on it from the beginning, certainly don't drop it on him out of nowhere.",
"During an undead encounter, the players hear singing and end up tracking down a Death Knight whose eternal curse is that he must sorrowfully sing every evil act he ever committed, and only when at least one single person has heard every single act, his curse will be lifted. Perhaps during his chorus, he goes into an aggressive mode and attacks the players, but then returns to a calm sorrowful state for each verse until finally after finishing his song, he falls apart into a pile of bones",
"A necromancer purchases a prison 'As is', including all prisoners for a large amount of money and then uses the prisoners in his experiments. When I ran it, it played like a survival horror game and included a flesh golem and a living rogue who does the necromancer's bidding for unknown reasons.",
"A recurring family of gnomes is always seeking each other. Each campaign or adventure may have a different gnome of the same family, always looking for each other, always one step behind.",
"An ogre disrupts a druid ritual and the druids demand a blood sacrifice either from the ogre or a member of the town watch in charge of patrolling the mountains where the ogre came from.",
"An author approaches one or more of the players because he wants to write a book about them. What the players don't realize is that the author is planning to model his villains after them, not the heroes.",
"The players are about to venture to a particularly treacherous location as part of their next adventure. A local herbalist asks them to bring back a plant that only grows in that area and agrees to pay them handsomely for it. The plant is a powerful hallucinogen and even casual contact with it will influence a person's perception.",
"A group of recently retired adventurers have formed an acting troupe and are gaining a solid reputation for their performances. Although applauded by high society, the regular people see this new career choice as laughable and demeaning for real men. The troupe approached the gruffest, manly-man in the party and asked him to join them on stage for an uplayeroming performance. They claim that they've seen him fight and feel his grace in battle makes him a natural performer.",
"During a night of heavy drinking one or more of the players believes they see a man with a strange tattoo on his left hand. At first they don't pay it any mind, but eventually they remember that there is a substantial reward for a dangerous escaped criminal with that exact tattoo. Now where'd he go?",
"One night in the local tavern, the players tell tales of their recent exploits in a far-away land. A man joins their table and offers to buy them a round. Although he's never been to this place he has two sons that live there. He goes on and on about how proud he is of his boys. The players soon realize that they actually killed one of the sons during their adventures and that the other son has sworn revenge upon the players.",
"A very pregnant Human woman begs the players for help. She's going to have her baby next week. She's concerned that her husband is not the baby's father. She won't know until the child is born. (Her husband is Human, but the child may have pointed ears.) If she needs to leave town quickly and quietly will the players help her?",
"[She is in fact a Changeling spy. No one in town knows the truth, including her husband. Although she's been completely faithful to her husband, she knows that there is a 50/50 chance the child will look like a Changeling when born. Not only will it devastate her husband but it will blow her cover.]",
"In order to smooth over diplomatic relations between two kingdoms, one of the players must agree to be betrothed to a Princess as part of a peace treaty. She's only 12 years old. The players must swear to remain chaste and loyal to his betrothed until she reaches her 18th birthday and they can wed. If he breaks this vow the treaty is voided. Suddenly those who want to see the treaty dissolved hire the most beautiful women to tempt the player.",
"For years the players have collected many art objects among their various treasures. One painting becomes especially valuable when a fire destroys almost all other known works by a recently deceased artist. The heroes obviously don't carry the painting around with them, but will want to make sure it's still safe when they realize how much it's appreciated. When word gets out that the players have one of the last known works by this artist they have to deal with those who wish to purchase and steal the painting.",
"Made popular through song, the lyrics of a well-known ballad described how the bastard son of a nobleman proved his claim to the throne by presenting an ornamental dagger that his father left him as a child. The song describes the dagger in extraordinary detail. The noble, now all grown up, will be visiting the local town during their annual fair in a few days. When he arrives the players realize that that ornamental dagger he carries is the one from the song. Except the jewel in the pommel is green, not blue as the song lyrics describe. Is the song inaccurate or is this man an impostor?",
"A young child begins to manifest mage powers and is causing havoc.",
"A couple forbidden to be together runs off to a dangerous ruin.",
"The heroes must protect a noble from an assassin.",
"A tinkerer is selling dangerous arcane artifacts to unsuspecting buyers.",
"The popular new parties thrown by a noble are attracting the wrong type of attention.",
"A Blood Mage cult is abducting people to use for blood magic sacrifices.",
"Strange lights and sounds come from an old elven ruin.",
"A dying miner claims to have found a mother lode of lyreum.",
"A cursed item passes from hand to hand, corrupting those it touches.",
"A demon possesses a living person to fulfill an ancient obligation made with a person no longer alive.",
"Envoys are assigned to escort visiting ambassadors or representatives from nearby Banns.",
"A friend of the heroes asks for help in settling a duel of honor.",
"A respected noble is accused of serious crimes; is it a frame-up?",
"The body of a respected Avvar or Chasind chief must be escorted to his homelands in honor.",
"Intrigue abounds at a seasonal festival.",
"An encounter with an ancient arcane item alters the heroes in some way until they can find a cure.",
"The heroes dream about a previous Age. Are they reliving past lives?",
"There are rumors of a Tevinter Magister still existing as a spectre.",
"A mysterious killer stalks the nighttime streets of a city.",
"Two port towns dispute over the ownership of a sunken vessel.",
"The 'secret ingredient' of a fad food comes from the Korcari Wilds.",
"A child or family is lost in the wilderness and is in need of rescue.",
"Two embattled Teyrns are planning secret raids on a dwarven shipment of gold to the King.",
"Darkspawn are gathering, but why?",
"An ancient dwarven gate opens and disgorges darkspawn or other creatures.",
"A new prophet rises up in Orlais, sensing the threat of a Blight growing in Ferelden.",
"The Dalish call for aid against the werewolves invading their hunting grounds.",
"Blight wolves and blight bears emerge from the wilderness to attack outlying towns.",
"A young man begs the heroes to help stop a wedding because he is in love with the bride.",
"Thieves steal the royal seal from the palace.",
"Strangely intelligent darkspawn begin organizing into a mercenary company, working for the highest bidder.",
"Pirates attack merchant vessels along the coast.",
"A map to a lost artifact falls into the heroes' hands.",
"Apostates organize into a coven and begin sowing dissent and misery in outlying farms and villages.",
"A demon preys on dreams, twisting them into nightmares.",
"A lost storehouse of ancient lore is guarded by possessed corpses.",
"A terrible storm wracks the coast and islands. Locals believe it to be magical.",
"Chasind barbarians, led by an apostate mage, raid coastal settlements.",
"A wronged noble needs a champion to fight in a duel of honor.",
"A child missing for years is seen running through the woods late one night.",
"A quake in the Korcari Wilds reveals the ancient ruins of a Tevinter Mages stronghold.",
"The Chantry asks the heroes to aid in smuggling missionaries out of the Korcari Wilds or Avvar Tribal Lands.",
"The heroes must guard a caravan through dangerous territory.",
"The Chantry threatens to execute a well-known friend, claiming that he or she is an apostate.",
"Accusations of corruption mar a deceased noble's memorial service.",
"Animals mysteriously attack the local chantry, driven by an ancient artifact kept among its relics.",
"A harsh winter leads to conflict between the Dalish and Chasind tribes.",
"Everyone in an isolated village has disappeared without a trace.",
"A fellen and dying hero seeks aid in achieving a measure of redemption and peace.",
"A daring thief steals from the wealthiest people of a city.",
"The planned site of a new settlement is plagued by darkspawn or worse.",
"Fereldans and a tribal community (Avvar, Dalish, or Chasind) dispute the clearing of some forest land.",
"Members of a powerful Tevinter or Dwarven merchant's family are targeted for assassination.",
"The king of Ferelden must move the court to a distant city for a time.",
"The heroes are assigned as the escort of a troublesome noble.",
"Miners in the mountains uncover a lost Thaig.",
"Qunari raiders strike at outlying farms and villages, taking people to sell as slaves.",
"An apostate begins working with demon possessed corpses in the Korcari Wilds.",
"A Blood Mage cult hunts rare creatures to obtain strange arcane powers.",
"Rumors arise of a corrupt gryphon in the Brecilian forest.",
"The politics of the Circle Tower spill out into the most recent Landsmeet. Circle Mages demand appropriate representation.",
"A follower of Andraste begins to whip up fervor against all magic, calling for an Exalted March to destroy the Circle Tower and more.",
"An ancient dwarven golem is accidentally awakened.",
"A region of the kingdom is struck by plague. The cure lies in distant lands.",
"A young mage begins having visions of the future, which to date have always come true!",
"The Orlesians plan another invasion of Ferelden.",
"Foreign agents kidnap a noble's child to force cooperation.",
"A seemingly idyllic village is a front for a potent Blood Mage, who enforces peace and justice through magic.",
"The barbarian and tribal peoples of Ferelden contemplate war.",
"Relics are stolen from a chantry.",
"A Blood Mage or Apostate uses magic to grant unearthly beauty to any willing to pay for it.",
"Mabari kennels are plagued by attacks from horrible creatures normally found in the Deep Roads.",
"The son or daughter of a visiting foreign dignitary falls in love with a young knight in Denerim.",
"The heirs of two feuding noble families wish to marry despite their families' wishes.",
"A noble is poisoned in an assassination attempt, and the heroes must rush to find a cure in time.",
"The heroes must enter the Fade to overcome a powerful demon's curse.",
"Mages throughout the realm dream of someone calling for help from a distant land.",
"A town suffering a blight claims they were cursed by the Dalish.",
"A fire tears through a forest sacred to the Dalish (or other tribal community).",
"A young city elf runs off to join the Dalish, but her parents insist she returns.",
"The heroes awaken the morning after a seasonal festival with no memory of the previous three days.",
"A mysterious performer, the toast of the theater, may be an Orlesian or Tevinter spy.",
"A rejected squire seeks to prove himself worthy of knighthood.",
"A contact claims to have information, then turns up dead.",
"All of the children of a small community are altered or disappeared by darkspawn magic.",
"A fiery Fereldan Noble agitates for a preemptive war against the Orlesian Empire to overthrow the usurper and liberate the people.",
"A scholar asks for aid in exploring ancient ruins.",
"A noblewoman's journal or love letters fall into the wrong hands.",
"The heroes are asked to help break off an adulterous affair without the wronged spouse finding out.",
"A few chantries in Ferelden have fallen under the sway of the Orlesian Chantry, attracting radical power-seekers.",
"Avvar or Chasind raiders attack Fereldan settlers who inadvertently trespassed onto sacred ground.",
"An intelligent darkspawn offers to establish a non-aggression treaty on behalf of the Archdemon.",
"A noble attempts a coup to become king of Ferelden.",
"A girl in Orlais can perform miracles without magic, and receives visions from Andraste, or so it seems.",
"A group of city elves want a settlement entirely in their hands.",
"A group of werewolves claim they want to settle peacefully in a Fereldan forest.",
"A ghost ship, captained by a shadow, preys on vessels in the Amaranthine Ocean. (This could be changed to a pirate ship.)",
"A noble widow receives advice from the shade of her dead consort. Is it a trick or threat?",
"A radical noble appears to have the blessing of the Landsmeet to replace the current king.",
"The town guard thinks the party's mage is responsible for a magical duel fought atop the cathedral roof last night. Can the party find the real culprit before they are hunted down themselves? Do they dare, knowing that the criminal dispatched his last opponent with a frighteningly high level spell?",
"The party is taken aside to the guardhouse upon first entering the city. They are told the guard captain wants to speak with them. When the captain arrives, he attempts to shake down the party under pain of death.",
"A woman falls into the street from the second story window in front of the party and dies on impact. Soon after, a player notices a hooded figure skillfully dropping, uninjured, from another second story window facing into the alley. The figure quickly disappears into a maze of side streets.",
"The party is invited to a manor by an important socialite for a potential job opportunity. When they arrive, they are told to wait in an empty room. Soon after entering the room, the party realizes they are locked in with a magical ward.",
"The party stops to witness a funeral procession for a crime lord. Soon after passing, the party hears an explosion and sees a gigantic smoking fireball rise into the sky a block away.",
"In need of food and shelter from the elements (or from enemies), the characters come to a ruined tower full of revealing adventurers. But the Rules of the House say no one may enter until they have entertained the rabble with a rousing tale.",
"As you step out of the tavern, a disheveled girl smashes into you. 'Wilkenson's dog is loose again!' she exclaims as she attempts to hide behind you. You turn back in the direction she came to see a metal construct resembling a dog charging toward you.",
"The players spot a pregnant woman walking through the bazaar. As she passes the baker's stall she quickly grabs a loaf of bread and keeps walking, favoring one of the players with a wink as she goes. Is she a thief or the wife of the store owner?",
"The players are resting in their inn room when suddenly the door bursts open. A well-armed man with a weapon drawn storms in and says, 'Don't move, I've...crap, wrong room.' The intruder then quickly exits.",
"The players find the item they have been seeking in the marketplace. As the purchase is completed and they are about to leave, a stranger rushes up to the merchant shouting, 'I know you have Balthasar, and I want my back now!'",
"The inhabitants of a large building start a war against an identical neighboring building. At the beginning it's because they are accused of stealing their water, but in fact they have held many petty grudges for years and this way they can vent them out violently. The party is hired by fearful authorities to stop the revolt that threatens to scale into a civil war, but one of the tenants in the rebel building is a player's distant relative. Does the party intervene impartially, risking a family feud or do they help the relative exact revenge against his neighbors?",
"The party is mistaken by a wealthy man as carriage caretakers in a shantytown neighborhood. He hands them money to protect his vehicle. The legitimate caretakers challenge the players and try to steal the wealthy wagon. Does the party protect the rich man's vehicle or do they leave the locals to do as they please, risking later persecution by the noble client?",
"13. The players arrive at the inn and find a large group (at least three times their number) of mercenaries leaving for the jail where they plan to execute all the prisoners. The party is connected to one of the inmates (an old, recurrent, but not particularly hated enemy, maybe they put him behind bars in the first place) and wishes him to remain alive for some reason. Do they face the killers, race to save the prisoner first, warn the prisoners or set them all free?",
"The city has a zoo filled with wondrous and dangerous creatures brought from far places. Just recently, some of the creatures escaped and now there is a royal reward for recovering the rare animals unharmed. How can this be done?",
"A sector of the city lies under quarantine after an outbreak of a mysterious fever. The party is being kept inside, and one of its members is starting to show symptoms of the illness. Do they try to escape, risking further contagion, or do they try to find a cure from the inside?",
"The players are being chased by a criminal party through the streets of a city that celebrates its anniversary with improvised shows over plazas. They get caught in the middle of a show, in front of a demanding audience. The only way the mob will let them leave is by doing a successful artistic performance.",
"A gypsy intercepts the most charismatic member of the party and tells him of a vision she had. She predicts the party member will find a beautiful person in this city and it will be the love of his life. She provides no further details. Later on, a beautiful person flirts with the character.",
"One member of the party is seen carrying an exotic weapon and the authority of the local museum is told about it. This museum curator has been an adventurer and masters some kind of whip weapon. He prepares an ambush to steal the exotic weapon, yelling at the players on sight, 'That belongs in a museum!'",
"The Tourist. The players have messed up (possibly been framed) in the eyes of the King and have been apprehended. The King will release the party, if they allow a wealthy, influential and obese merchant to come along on a dungeon delve, where there are sure to be many tight spaces.",
"Medieval Proliferation. Two blacksmiths are in competition to create better melee weapons for the King's army and only one can win the contract. One of the blacksmiths approaches the players to try the weapons and plead their virtues to the King. He also claims his competitors are playing dirty.",
"Kindergarten Magic. Street urchins are rumored to have special powers. A representative of the Magicians Guild approaches your party to investigate. In reality, they are learning magic from an unknown source. The children have less inhibition and magical control, but have much more mana and capability of replenishing mana, making them dangerous magic users.",
"As the players turn a corner, a law enforcement officer slams into them at breakneck speed. As they help him up, they notice he is covered in blood with grievous wounds. As he dies in their arms, he begs them to find his wife and relay his sincerest love and apologies.",
"'Psst, do you want to buy a crystal ball that really works? It's cheap!' says a shady character while sneaking up on the players from an alley. The price really is cheap, and you might even lead the players to believe the ball works when they try to use it for petty things, but it is unreliable, maybe even cursed. And the big problem is that one or more groups of Nplayers badly want this crystal ball.",
"The players witness a break-in at a shop. If they intervene, then right at the end of the encounter the shop owner shows up and accuses the players of breaking in and causing damage in his shop. He immediately calls for the guard.",
"The party runs over or mortally injures a shepherd's goat by accident. After apologizing, the shepherd starts demanding money equivalent to three or four times what the goat's value is. Then, as things settle down, another shepherd comes up and displays another goat injured. City guards start to show an interest in the event as well....",
"A merchant discovers the players are buying something and comes to give them a more expensive offer for something of lesser quality. However, the merchant insists this is a good deal as his cousin works for the town hall and will cause great grief to the party if they refuse his offer.",
"Two speeding coaches collide, leaving a bloody scene and angry families. The road is blocked, and the guards seem disinterested in assisting with either clearing the road or arbitrating between the families.",
"Townspeople come up to the party and blame them for the local infestation of evil. If the players weren't there, so the argument goes, the evil would go elsewhere. A crowd gathers in support of their fellow citizens.",
"There is but one accepted religion in town. What about the party cleric who serves what is here deemed a false god?",
"Young lovers have taken the players' room as refuge to meet in. They are sought after by families that do not approve.",
"Injustice breaks out as a revolution against a tyrant. The players are there to see the first flames, and may play a pivotal role in either supporting or crushing the uprising.",
"A fast ship in the bay is bombarding the helpless port with siege engines. It's out of range for the locals to deal with, and possibly not alone.",
"The players hear shrieks from a dark alley where a young maiden just went. Under the full moon, she is painfully turning into a werewolf for the first time.",
"There have long been rumors of the cemetery being desecrated by someone stealing the corpses. One night the players chance upon the necromancer walking home with newly animated undead.",
"One or more players are short-changed by a merchant who considers himself untouchable. Whether he truly is....",
"An Nplayer seeks the protection of the players. To grant it makes her enemies the players' enemies, and gives them the responsibility to protect a high-profile, fragile person who can't or won't leave town.",
"players are marked by a guild of thieves or assassins for a contest. Low-skill, would-be guild members keep targeting the party with attempts on their health or goods.",
"The spoiled child of a noble finds a player has something he just *has to have*. The noble's staff does what it can to acquire it, by nearly any means necessary.",
"The appearance of the players breaks the balance of a cold war between two rival mages. Each wishes their support to destroy the other, and fears that the other is successful in recruiting the players.",
"A string of building construction accidents has occurred lately throughout the city. Fortunately, no one's been seriously hurt, but the accidents are increasing in size and damage. The local guild has put up flyers asking for help in solving their problem.",
"As the players walk across a bridge over the river that cuts through town, they notice a couple of young boys standing near the edge of the bridge. They each have a large rock in their hands, and are watching one of the approaching river boats with smiles on their faces. As the boat gets closer, one of the boys raises his rock as if he is going to drop it.",
"While traveling down by the docks, a ship captain waves the players over to talk. He's in a bind, he explains, saying that some of his dock workers didn't show up for work and he has a lot of cargo to load onto his ship so he can make the tide. The captain and crew look disreputable, and nervous, but he is willing to pay well for the work.",
"The players come upon a sobbing woman holding a teenage boy who looks to have been severely beaten. If the players ask the woman if they can help, she explains her youngest son was beaten up by a gang of toughs. Of more immediate danger though, is that her oldest son has gone off to exact revenge on them, and she's afraid of what they will do to him.",
"Down the dimly lit alley, two guards can be seen beating a kneeling man. One rips a coin purse from the kneeling man's belt and says, 'Don't be late next month, old man.'",
"Storm clouds hang heavy, and thick cold rain pounds down as it has for hours. Gutters gurgle, and the sewers moan as if carrying some great weight. From a drain, a swarm of thousands of black rats burst out and charge the players.",
"As the players are traveling from one district to another they are confronted by a traffic jam. A building has fallen in and the umber hulk responsible is hiding, waiting for a snack to move near it.",
"The players are hired as security for the auction of a mysterious artifact. While stopping repeated theft and auction-rigging attempts, they eventually learn of its evil nature and have to debate breaking their contract and destroying the thing while getting away with it.",
"Someone falls out the window of a high building. It wasn't suicide as he had his hands and feet bound together and three large sacks of gold tied around his neck. What will be more important, the murder or the money?",
"A rich man walks through a bad part of town with obvious riches and money. If mugged, he gives it willingly. He has been doing this for the last three days.",
"A small animal brushes past the players as they walk along a dock. After it jumps into the water, a group of sailors rushes onto the dock, firing crossbows and flinging harpoons at the ripples the animal left in the water. While the sailors curse and fire the last few missiles they have, one of the players notices the animal left a muddy gem on the top of her shoe.",
"After hearing a baby crying near the graveyard, a villager saw a baby lying on top of a grave. Before they could get to it, they saw a pair of hands reached out from the ground and brought the baby under.",
"Every night another tombstone is found vandalized with carvings. However, last night those carvings started glowing like runes and the wind grew wild and strong while they glowed.",
"Last week the blacksmith in town went missing and no one knew where they went until they were recently discovered dead, stuck on the inside of an underground tomb. However, they had completely decomposed in that time, leaving just bones and clothes.",
"A group of cult-like robed travelers came into town, demanding to speak with the 'King of the Dead'. They finally found who they were looking for- a child no older than six playing alone in the graveyard.",
"After a series of high profile grave robberies, a pair of robbers were found in dug up graves, dead, and in the embrace of their latest targets. They were also wearing the spoils of their previous crimes.",
"An acolyte tasked with maintaining the crypt has come out, pale and shaken, and only able to mutter the word 'honest'. Those who have gone down to the crypt since have not seen anything traumatic that would cause this.",
"Every night after midnight, the groundskeeper of the cemetery claims he can hear small bells ringing, coming from the area around the children's graves. Once he mustered up the courage to investigate, they stopped suddenly but returned the next night.",
"All the cats in town have been gathering at the graveyard every night. They don't do anything other than lay around, but their growing numbers by the night have the townsfolk freaked out.",
"The grass over certain graves has started to turn either red or blue. The pattern, according to the town historian, is regarding which side in a great conflict the buried took centuries ago.",
"The word 'HELP' was found scrawled onto a grave with chalk. Three days later, the grave was dug up by what looked like claws, not shovels. Now 'HELP' appears on another grave a short distance away.",
"The gravekeeper has started running a late night shop while on duty for people who need things at odd hours. At first it was just general goods, but now he is selling some fineries and jewels and there are suspicions on where he is getting these.",
"Disembodied hands were seen surfacing from graves and going into houses. When they returned to the graveyard some were wearing bracelets and rings before digging back down to their graves.",
"The shadows cast from torchlight at night have been growing longer and larger, and recently a villager claimed to see them move on their own. They do seem to stretch closer to the town, even when the sun shouldn't cast them in that direction.",
"Rats have emerged from the crypt and have been seen with bulbous growths on their bodies. These growths explode near people, making them sick and bedridden. The first such victim recently was seen shambling through town and trying to attack another villager!",
"Headstones have started to explode, sending stone and steel flying, apparently randomly. There is no discernible cause or pattern, making it all the more concerning.",
"A druid has visited the town, wanting to bless the recently deceased animals buried in the pet cemetery so that they may find their way back to the goddess of nature. He was last seen leading a procession of walking animal corpses out of town.",
"Red clouds form low over a mausoleum outside of town, with lightning occasionally striking the structure. Each strike of lightning rings out a different musical note.",
"Mutilated bats with their wings removed have been found scattered across the graveyard. Some appear to have had their wings ripped off while others were a cleaner cut.",
"A child was found unconscious in the graveyard in the early morning.She says she heard and saw a fairy singing in the graveyard that zapped her when she got close",
"A groundskeeper tripped and fell into a hole where solid ground above a grave should have been. The fall revealed a long tunnel with warm air coming through, and it had been covered up with a blanket made to resemble a dirt mound.",
"A deep voice emanates from within the crypt, telepathically beckoning those close by to come speak with their deceased loved ones. For obvious reasons, no one has dared enter the crypt since.",
"Colorful lights dance and weave over the mausoleum at night before finally entering back through the cracks in the building and a curious villager follows them in. Those outside at the time heard a scream, and the villager has yet to come out 3 days later.",
"Odd body parts have been found near the edges of the graveyard. This was the source of confusion until an entire body appeared to be floating towards the edge. It wasn't until the gravekeeper approached it that an uncountable number of spiders that had been carrying the body scattered and hid.",
"A black, viscous liquid has been seeping through the top of the graves, turning the graveyard into a swampy mess. Upon touching flesh the liquid burns like acid, and the local alchemist is completely befuddled as to what it might be.",
"After being caught and tried for his crimes, the leader of a local bandit gang was burned and not properly buried. Now the townsfolk claim his spirit haunts the cemetery to prevent them from letting them put their loved ones to rest."]